# Explarotary Data Analysis

In [1]:
#import required packages
import pandas as pd
import numpy as np
import sys
sys.path.insert(0,'../scripts/')
from data_fetch import get_data

In [2]:
driver_location_data = get_data('data/driver_locations_during_request.csv','C:/Users/User/Desktop/Causal-Inference','driver_locations_during_request_v1')
nb_data = get_data('data/nb.csv','C:/Users/User/Desktop/Causal-Inference','nb_v1')

In [3]:
driver_location_data.head()

,id,order_id,driver_id,driver_action,lat,lng,created_at,updated_at
0,1,392001,243828,accepted,6.602207,3.270465,NaN,NaN
1,2,392001,243588,rejected,6.592097,3.287445,NaN,NaN
2,3,392001,243830,rejected,6.596133,3.281784,NaN,NaN
3,4,392001,243539,rejected,6.596142,3.280526,NaN,NaN
4,5,392001,171653,rejected,6.609232,3.288800,NaN,NaN

In [5]:
nb_data.head()

,Trip ID,Trip Origin,Trip Destination,Trip Start Time,Trip End Time
0,391996,"6.508813001668548,3.37740316890347","6.650969799999999,3.3450307",2021-07-01 07:28:04,2021-07-01 07:29:37
1,391997,"6.4316714,3.4555375","6.4280814653326,3.4721885847586",2021-07-01 06:38:04,2021-07-01 07:07:28
2,391998,"6.631679399999999,3.3388976","6.508324099999999,3.3590397",2021-07-01 06:21:02,2021-07-01 07:02:23
3,391999,"6.572757200000001,3.3677082","6.584881099999999,3.3614073",2021-07-01 07:16:07,2021-07-01 07:29:42
4,392001,"6.6010417,3.2766339","6.4501069,3.3916154",2021-07-01 09:30:59,2021-07-01 09:34:36

In [6]:
driver_location_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1557740 entries, 0 to 1557739
Data columns (total 8 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   id             1557740 non-null  int64
 1   order_id       1557740 non-null  int64
 2   driver_id      1557740 non-null  int64
 3   driver_action  1557740 non-null  object
 4   lat            1557740 non-null  float64
 5   lng            1557740 non-null  float64
 6   created_at     0 non-null        float64
 7   updated_at     0 non-null        float64
dtypes: float64(4), int64(3), object(1)
memory usage: 95.1+ MB

In [7]:
nb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 536020 entries, 0 to 536019
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Trip ID           536020 non-null  int64
 1   Trip Origin       536020 non-null  object
 2   Trip Destination  536020 non-null  object
 3   Trip Start Time   534369 non-null  object
 4   Trip End Time     536019 non-null  object
dtypes: int64(1), object(4)
memory usage: 20.4+ MB

In [10]:
driver_location_data.isna().sum()

id                     0
order_id               0
driver_id              0
driver_action          0
lat                    0
lng                    0
created_at       1557740
updated_at       1557740
dtype: int64

In [11]:
nb_data.isna().sum()

Trip ID                0
Trip Origin            0
Trip Destination       0
Trip Start Time     1651
Trip End Time          1
dtype: int64

In [12]:
driver_location_data.columns

Index(['id', 'order_id', 'driver_id', 'driver_action', 'lat', 'lng',
       'created_at', 'updated_at'],
      dtype='object')

In [13]:
nb_data.columns

Index(['Trip ID', 'Trip Origin', 'Trip Destination', 'Trip Start Time',
       'Trip End Time'],
      dtype='object')

In [17]:
driver_location_data.groupby('driver_id').count()

             id  order_id  driver_action   lat   lng  created_at  updated_at
driver_id
121981     2149      2149           2149  2149  2149           0           0
171091     2715      2715           2715  2715  2715           0           0
171092     3630      3630           3630  3630  3630           0           0
171098     1257      1257           1257  1257  1257           0           0
171101      489       489            489   489   489           0           0
...         ...       ...            ...   ...   ...         ...         ...
247508        1         1              1     1     1           0           0
247709        2         2              2     2     2           0           0
247794        1         1              1     1     1           0           0
247831       21        21             21    21    21           0           0
247877        2         2              2     2     2           0           0

[1213 rows x 7 columns]

In [18]:
nb_data['Trip ID'].value_counts().unique

<bound method Series.unique of 391996     1
1180070    1
1180061    1
1180060    1
1180059    1
          ..
789757     1
789755     1
789751     1
789750     1
1637709    1
Name: Trip ID, Length: 536020, dtype: int64>

In [19]:
driver_location_data.driver_action.value_counts()

rejected    1531837
accepted      25903
Name: driver_action, dtype: int64

In [21]:
driver_location_data.drop(columns=['created_at','updated_at'])

              id  order_id  driver_id driver_action       lat       lng
0              1    392001     243828      accepted  6.602207  3.270465
1              2    392001     243588      rejected  6.592097  3.287445
2              3    392001     243830      rejected  6.596133  3.281784
3              4    392001     243539      rejected  6.596142  3.280526
4              5    392001     171653      rejected  6.609232  3.288800
...          ...       ...        ...           ...       ...       ...
1557735  1557736    517948     243774      rejected  6.469036  3.566877
1557736  1557737    517948     245447      rejected  6.425431  3.527358
1557737  1557738    517948     239866      rejected  6.440013  3.525378
1557738  1557739    517948     243774      rejected  6.469036  3.566877
1557739  1557740    517948     244170      rejected  6.469390  3.572079

[1557740 rows x 6 columns]